"""
На вход программе подаётся последовательность цифр,
которую нужно вывести на экран в специальном стиле (см. пример).
x-------------------------------------------------x
| --        --   --        --   --   --   --   -- |
||  |    |    |    | |  | |    |       | |  | |  ||
||  |    |    |    | |  | |    |       | |  | |  ||
|           --   --   --   --   --        --   -- |
||  |    | |       |    |    | |  |    | |  |    ||
||  |    | |       |    |    | |  |    | |  |    ||
| --        --   --        --   --        --   -- |
x-------------------------------------------------x
Размер всех цифр 4 символа в ширину и 7 символов в высоту.
Между цифрами в выводе должен быть один пустой столбец. Перед первой цифрой не должно быть пробелов.

Выведенные цифры должны быть обведены рамочкой,
в углах которой находится символ x ("икс"),
горизонтальная линия создаётся из символа - ("дефис"), а вертикальная -- из символа вертикальной черты: |.

Формат ввода:
Строка произвольной длины (минимум один символ), содержащая последовательность цифр.

Формат вывода:
9 строк, содержащих цифры, записанные в указанном в задании формате.
"""

dict_lcd = {
    '0': ["  -- ", " |  |", " |  |", "     ", " |  |", " |  |", "  -- "],
    '1': ["     ", "    |", "    |", "     ", "    |", "    |", "     "],
    '2': ["  -- ", "    |", "    |", "  -- ", " |   ", " |   ", "  -- "],
    '3': ["  -- ", "    |", "    |", "  -- ", "    |", "    |", "  -- "],
    '4': ["     ", " |  |", " |  |", "  -- ", "    |", "    |", "     "],
    '5': ["  -- ", " |   ", " |   ", "  -- ", "    |", "    |", "  -- "],
    '6': ["  -- ", " |   ", " |   ", "  -- ", " |  |", " |  |", "  -- "],
    '7': ["  -- ", "    |", "    |", "     ", "    |", "    |", "     "],
    '8': ["  -- ", " |  |", " |  |", "  -- ", " |  |", " |  |", "  -- "],
    '9': ["  -- ", " |  |", " |  |", "  -- ", "    |", "    |", "  -- "]
}
main_list = []


def culc_lcd(number):
    arr = [i for i in number]
    for j in range(len(arr)):
        main_list.append(dict_lcd[arr[j]])
    length = "-" * ((len(arr) * 5) - 1)
    top = "x" + length + "x\n"
    bottom = "x" + length + "x"
    rez_str = top
    for v in range(0, 7):
        rez_str += "|"
        for w in range(len(main_list)):
            if w == 0:
                rez_str += main_list[w][v][1:]
                continue
            else:
                rez_str += main_list[w][v]
        rez_str += "|\n"
    rez_str += bottom
    return rez_str


number = input("Enter your number anl press ENTER: ")
print(culc_lcd(number))
